app/controllers/tasklists_controller.rb

  def index
    @tasklist = Tasklist.all
---
SELECT "tasklists".* FROM "tasklists"

  def create
    @tasklist = Tasklist.new(tasklist_params)
    @tasklist.save
---
INSERT INTO "tasklists" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "kkk"], ["text", "kkkk"], ["created_at", 2017-03-09 23:41:40 UTC], ["updated_at", 2017-03-09 23:41:40 UTC]]

  def update
    @tasklist = tasklist_of_id
    @tasklist.update(tasklist_params)
---
UPDATE "tasklists" SET "title" = ?, "updated_at" = ? WHERE "tasklists"."id" = ?  [["title", "0000000000000"], ["updated_at", 2017-03-09 23:42:45 UTC], ["id", 8]]

  def destroy
    @tasklist = tasklist_of_id
    @tasklist.delete
---
DELETE FROM "tasklists" WHERE "tasklists"."id" = ?  [["id", 21]]